run/pitzDaily_LES_3D_dynak_v2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       351725;
    }
    outlet
    {
        type            patch;
        nFaces          570;
        startFace       352025;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2230;
        startFace       352595;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       354825;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12225;
        startFace       357325;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12225;
        startFace       369550;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
